app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" DESC
---
  def index
    @blogs = Blog.all

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('hello') OR LOWER(name) = LOWER('kamran') OR LOWER(name) = LOWER('khalid'))
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hello"], ["created_at", "2021-06-20 05:07:30.857406"], ["updated_at", "2021-06-20 05:07:30.857406"]]
UPDATE "tags" SET "taggings_count" = COALESCE("taggings_count", 0) + $1 WHERE "tags"."id" = $2  [["taggings_count", 1], ["id", 6]]
---
    def add_tags
      arr = blog_params[:tags].split(',')
      arr.each do |a|
        @blog.tag_list.add(a)
      end
      @blog.save